ml-notes.org
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/
#+REVEAL_THEME: night
# +OPTIONS: num:nil
#+LATEX_HEADER: \usepackage{algpseudocode}
 
#+Title: Machine Learning Notes 
#+AUTHOR: Ziwei

* Logistic Regression   
** Three linear models 
1. linear classification(perceptron): $h(x)=sign(s)$ 
   - output is 1 or 0
2. linear regression: $h(x)=s$ 
   - output is linear transformation   
3. logistic regression: $h(x)= \theta(s)$
   - output is a probability given by a sigmoid function    
where $s=\sum_{i=0}^{d}w_{i}x_{i}$ 

** Sigmoid function
also known as the sigmoid or logistic function 
$$
\sigma(w^Tx) = \frac{1}{1+e^{-w^T x}} 
$$

** Logistic Regression Function 
The logistic regression model specifies the probability of a binary output $y_i \in \{0,1\}$ given the input $x_i$ as follows:
$$
\left.\begin{aligned} p ( \mathbf { y } | \mathbf { X } ,\theta ) & = \prod _ { i = 1} ^ { n } \operatorname{Ber} \left( y _ { i } | \operatorname{sigm} \left( \mathbf { x } _ { i } \theta \right) \right) \\ & = \prod _ { i = 1} ^ { n } \left[ \frac { 1} { 1+ e ^ { - x _ { i } \theta } } \right] ^ { y _ { i } } \left[ 1- \frac { 1} { 1+ e ^ { - x _ { i } \theta } } \right] ^ { 1- y _ { i } } \end{aligned} \right.
$$
where $x _ { i } \theta = \theta _ { 0} + \sum _ { j = 1} ^ { d } \theta _ { j } x _ { i j }$

