ml-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Machine Learning Notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ziwei" />
</head>
<body>
<div id="content">
<h1 class="title">Machine Learning Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org80a7c67">1. Logistic Regression</a>
<ul>
<li><a href="#org581d987">1.1. Three linear models</a></li>
<li><a href="#org1e5cd46">1.2. Sigmoid function</a></li>
<li><a href="#org5fce5b4">1.3. Logistic Regression Function</a></li>
<li><a href="#org7b5e283">1.4. Error measure(Cross-entropy Error)</a></li>
<li><a href="#org0a3cf38">1.5. Gradient Descent</a></li>
<li><a href="#org1c5e88f">1.6. Algorithm</a></li>
<li><a href="#org66dfb90">1.7. Termination Criteria Considerations</a></li>
<li><a href="#org12aea49">1.8. Date snooping</a></li>
</ul>
</li>
<li><a href="#orgc957f01">2. Support Vector Machine</a>
<ul>
<li><a href="#orgb35c8ad">2.1. Margin</a></li>
<li><a href="#org6b81aeb">2.2. Optimization Problem</a></li>
<li><a href="#org3a15107">2.3. Dealing with none linearly separable data</a></li>
<li><a href="#org5a9e0c6">2.4. Soft Margin</a></li>
<li><a href="#org849ef51">2.5. Mapping input space to higher dimension</a></li>
<li><a href="#orgeab858e">2.6. Kernel Function</a></li>
</ul>
</li>
<li><a href="#orgca3e68d">3. Decision Tree</a>
<ul>
<li><a href="#org97d0750">3.1. Algorithm</a></li>
<li><a href="#org5a0be2a">3.2. Entropy</a></li>
<li><a href="#orgdf5ca26">3.3. Building decision tree</a></li>
<li><a href="#org5b54601">3.4. Dealing with multi-nomial features  and continuous features</a></li>
<li><a href="#org74a8551">3.5. Over-fitting</a></li>
<li><a href="#org0957204">3.6. Regression Tree</a></li>
</ul>
</li>
<li><a href="#org4fe4220">4. Questions</a></li>
<li><a href="#orgd61166d">5. Machine Learning Handson</a>
<ul>
<li><a href="#org533f2d9">5.1. Make machine learning research reproducible, make it pubic</a></li>
</ul>
</li>
<li><a href="#orgba1076e">6. Feature engineering</a>
<ul>
<li><a href="#orgf731fc3">6.1. Feature subset selection</a></li>
<li><a href="#org759b946">6.2. The filters which extract features from the data without any learning involved</a></li>
<li><a href="#orgd4e4cd1">6.3. Dealing with missing values</a></li>
<li><a href="#org5673e18">6.4. Dealing with Categorical data</a></li>
</ul>
</li>
<li><a href="#orgad36962">7. Visualization of High Dimensional Data</a>
<ul>
<li><a href="#org9179e32">7.1. TSNE</a></li>
</ul>
</li>
<li><a href="#org1e0645b">8. Experiment Design for ML algorithm Evaluation</a>
<ul>
<li><a href="#orge0fe96e">8.1. Why high sparsity is desired in many ML applications?</a></li>
<li><a href="#orga88818f">8.2. Performance Matrice</a></li>
<li><a href="#org25b30a6">8.3. Models that perform well across low-dimension to high-dimension data</a></li>
</ul>
</li>
<li><a href="#orga4b22b7">9. XGBoost</a></li>
<li><a href="#org29bc632">10. Pipelines</a></li>
<li><a href="#org06bcf68">11. Cross Validation</a></li>
<li><a href="#orgc692fd1">12. Data leakage</a></li>
<li><a href="#org44a213b">13. General Visualization</a>
<ul>
<li><a href="#orgaf40acc">13.1. Partial Dependence Plots</a></li>
</ul>
</li>
<li><a href="#org7ef7f12">14. Debugging and Error Analysis</a>
<ul>
<li><a href="#orgd1e85b8">14.1. Debugging learning algorithms</a>
<ul>
<li><a href="#org633457b">14.1.1. high variance or overfitting: if error is low on training but high on testing. Overlearning the training data but no generalizing well</a></li>
<li><a href="#org4b682ae">14.1.2. high bias: if error is high on training regardless of training samples. Not enough features to learn the problem</a></li>
<li><a href="#org8655dc9">14.1.3. algorithm not converging</a></li>
<li><a href="#org0765e28">14.1.4. Not optimizing the right objective function</a></li>
</ul>
</li>
<li><a href="#org4b69ce7">14.2. Error analysis vs. ablative analysis</a>
<ul>
<li><a href="#orgc9c1607">14.2.1. Error analysis tries to explain the difference between current performance and perfect performance.</a></li>
<li><a href="#org93c6672">14.2.2. Ablative analysis tries to explain the difference between some baseline performance and current performance. Eg. consider a image recognition algorithm with baseline performance of 94%, and best performance of 99%.</a></li>
</ul>
</li>
<li><a href="#org1419644">14.3. Two approaches to ML problems</a></li>
</ul>
</li>
<li><a href="#orgf056a2c">15. misc</a>
<ul>
<li><a href="#org6d3b27c">15.1. treatment effect</a></li>
<li><a href="#orgba99546">15.2. parameteric</a></li>
<li><a href="#orgce415c2">15.3. non-parameteric</a></li>
<li><a href="#org8a03530">15.4. unconfoundedness</a></li>
</ul>
</li>
<li><a href="#org1949e27">16. Foundations</a>
<ul>
<li><a href="#org719bad3">16.1. Probability Theory</a>
<ul>
<li><a href="#org3b5b9af">16.1.1. Bayesian Probability</a></li>
<li><a href="#orgd31a870">16.1.2. The Gaussian distribution</a></li>
<li><a href="#org6035efc">16.1.3. Curve fitting</a></li>
</ul>
</li>
<li><a href="#org41a8235">16.2. Model Selection</a></li>
<li><a href="#org18a35ea">16.3. The Curse of Dimensionality</a></li>
<li><a href="#org32299fa">16.4. Decision Theory</a></li>
<li><a href="#orgfc91ee0">16.5. Information Theory</a></li>
</ul>
</li>
<li><a href="#orgfe505cf">17. Probability Distributions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org80a7c67" class="outline-2">
<h2 id="org80a7c67"><span class="section-number-2">1</span> Logistic Regression</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org581d987" class="outline-3">
<h3 id="org581d987"><span class="section-number-3">1.1</span> Three linear models</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>linear classification(perceptron): \(h(x)=sign(s)\) 
<ul class="org-ul">
<li>output is 1 or 0</li>
</ul></li>
<li>linear regression: \(h(x)=s\) 
<ul class="org-ul">
<li>output is linear transformation</li>
</ul></li>
<li>logistic regression: \(h(x)= \theta(s)\)
<ul class="org-ul">
<li>output is a probability given by a sigmoid function</li>
</ul></li>
</ol>
<p>
where \(s=\sum_{i=0}^{d}w_{i}x_{i}\) 
</p>
</div>
</div>

<div id="outline-container-org1e5cd46" class="outline-3">
<h3 id="org1e5cd46"><span class="section-number-3">1.2</span> Sigmoid function</h3>
<div class="outline-text-3" id="text-1-2">
<p>
also known as the sigmoid or logistic function 
\[
\sigma(w^Tx) = \frac{1}{1+e^{-w^T x}} 
\]
</p>
</div>
</div>

<div id="outline-container-org5fce5b4" class="outline-3">
<h3 id="org5fce5b4"><span class="section-number-3">1.3</span> Logistic Regression Function</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The logistic regression model specifies the probability of a binary output \(y_i \in \{0,1\}\) given the input \(x_i\) as follows:
\[
\left.\begin{aligned} p ( \mathbf { y } | \mathbf { X } ,\theta ) & = \prod _ { i = 1} ^ { n } \operatorname{Ber} \left( y _ { i } | \operatorname{sigm} \left( \mathbf { x } _ { i } \theta \right) \right) \\ & = \prod _ { i = 1} ^ { n } \left[ \frac { 1} { 1+ e ^ { - x _ { i } \theta } } \right] ^ { y _ { i } } \left[ 1- \frac { 1} { 1+ e ^ { - x _ { i } \theta } } \right] ^ { 1- y _ { i } } \end{aligned} \right.
\]
where \(x _ { i } \theta = \theta _ { 0} + \sum _ { j = 1} ^ { d } \theta _ { j } x _ { i j }\)
</p>
</div>
</div>
