ml-notes.org
** Error measure(Cross-entropy Error)
Based on **Likelihood**: if hypothesis h = f, how likely to get y from x.
Given a set of training data points $(x_i, y_i), i = 1,...,n,$ where $y_i \in \{0, 1\}$.
We need to find a weight vector w s.t. the probability of the correct $y_i \text{ for } x_i$ is high for $i=1,...n$
$$
max P(y=y_i|x_i; w)
$$ (maxmize the log likelihood)
Equiv to  
$$
min -\sum_{i=1}^n log P(y=y_i|x_i; w) 
$$ (minimize the negative log likelihood)

** Gradient Descent
Compared to linear regression, logistic regression does not have a closed-form solution, instead of a **iterative solution** is used, which is called **gradient descent** 
1. Start at w(0)
2. Takes a step along the steepest slope
3. Takes a step toward that direction
4. Repeat until no local improvement is possible

** Algorithm
This is the algorithm for batch learning of logistic regression. It is very similar to linear classification's algorithm (perceptron). Both learns a linear decision boundary.
\begin{algorithmic}
\State Given: $(x_i, y_i), i = 1,...n$
\State Initialize $w = (0,...,0)$
\Repeat
  \State $\Delta = (0,...,0)$
  \For{$i = 1, ..., n$}
    \State $\hat { y } _ { i } = \frac { 1} { 1+ e ^ { - w } T _ { x _ { i } } } $
    \State $\nabla = \nabla + \left( \hat { y } _ { i } - y _ { i } \right) x _ { i } $
  \EndFor  
  \State $w = w - \eta \Delta $
\Until{$|\Delta|\leq \epsilon$}
\end{algorithmic}

** Termination Criteria Considerations
The setting of terminating condition can be tricky for gradient descent
- If terminates prematurely, the algorithm may not reach the global minimum
- If there is a local minimum, the algorithm may get stuck in local minimum
- If set an expected global minimum, it may never be reached by the algorithm 

** Date snooping
Looking at the data before choosing the model is problematic, can lead to a fallacy 
- this is different from using human expertise knowledge for feature engineering, which can help the model

* Support Vector Machine
One of the most successful classification algorithm in machine learning. Given multiple decision boundaries that split the data, SVM seeks to find a **hyperplane** that separate the data, such that the **margin** is maximized to the nearest trained data points. It is a constrained optimization problem.
** Margin
Given a linear decision boundary defined by $w^Tx+b=0$. The functional margin for a point $(x^i, y^i)$ is defined as
$$
y^i(w^Tx^i + b)
$$
For a fixed w and b, the larger the functional value, the more confident we have about the prediction. However, the functional margin can be arbitrarily changed without changing the boundary at all. So we use geometric margin instead.
**Geometric Margin**
The distance between an example and the decision boundary.
For training set $S=\{x^i, y^i\}: i = 1, ... N$ and boundary $w^T+ b = 0$, compute the geometric margin of all points: 
$$\gamma^i = \frac{y^i(W \cdot X^i + b}{||W||}, i = 1, ..., N$$
Note: $\gamma^i > 0$ if point i is correctly classified
We want to see if the smallest $\gamma^i$ is large. 
$$\gamma =\min_{i=1...n} \gamma^i$$
** Optimization Problem
Maximizing the geometric margin is equivalent to minimizing the magnitude of w subject to maintaining a functional margin of at least 1. 
$$ \min _ { w ,b } \frac { 1} { 2} \| \mathbf { w } \| ^ { 2} $$
$$ \text{ subject to } : y ^ { i } \left( \mathbf { w } \cdot \mathbf { x } ^ { i } + b \right) \geq 1,i = 1,\cdots ,N $$
Results in a quadratic optimization problem with linear inquality constraint. There are several algorithms for solving for QP. We can regard them as black box. The solution can be written in forms of 
$$ \mathbf { w } = \sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } x ^ { i } ,\quad s .t .\sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } = 0 $$  
The above equation provide the form for w, the value of b can be computed with some additional steps
- w is a linear combination fo all training exampls
- many points have zero $\alpha$'s, which are the data points that have larger geometric margin 
- points that have non-zero $\alpha$'s are called **support vector**, which are the data points that have smallest geometric margin

** Dealing with none linearly separable data  
If data are not linearly separable or data have noise. It becomes difficult to use SVM. We have two ways to deal with these issues. 

