ml-notes.html

<div id="outline-container-org7b5e283" class="outline-3">
<h3 id="org7b5e283"><span class="section-number-3">1.4</span> Error measure(Cross-entropy Error)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Based on <b><b>Likelihood</b></b>: if hypothesis h = f, how likely to get y from x.
Given a set of training data points $(x_i, y_i), i = 1,&#x2026;,n,$ where \(y_i \in \{0, 1\}\).
We need to find a weight vector w s.t. the probability of the correct \(y_i \text{ for } x_i\) is high for \(i=1,...n\)
\[
max P(y=y_i|x_i; w)
\] (maxmize the log likelihood)
Equiv to  
\[
min -\sum_{i=1}^n log P(y=y_i|x_i; w) 
\] (minimize the negative log likelihood)
</p>
</div>
</div>

<div id="outline-container-org0a3cf38" class="outline-3">
<h3 id="org0a3cf38"><span class="section-number-3">1.5</span> Gradient Descent</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Compared to linear regression, logistic regression does not have a closed-form solution, instead of a <b><b>iterative solution</b></b> is used, which is called <b><b>gradient descent</b></b> 
</p>
<ol class="org-ol">
<li>Start at w(0)</li>
<li>Takes a step along the steepest slope</li>
<li>Takes a step toward that direction</li>
<li>Repeat until no local improvement is possible</li>
</ol>
</div>
</div>

<div id="outline-container-org1c5e88f" class="outline-3">
<h3 id="org1c5e88f"><span class="section-number-3">1.6</span> Algorithm</h3>
<div class="outline-text-3" id="text-1-6">
<p>
This is the algorithm for batch learning of logistic regression. It is very similar to linear classification&rsquo;s algorithm (perceptron). Both learns a linear decision boundary.
</p>
\begin{algorithmic}
\State Given: $(x_i, y_i), i = 1,...n$
\State Initialize $w = (0,...,0)$
\Repeat
  \State $\Delta = (0,...,0)$
  \For{$i = 1, ..., n$}
    \State $\hat { y } _ { i } = \frac { 1} { 1+ e ^ { - w } T _ { x _ { i } } } $
    \State $\nabla = \nabla + \left( \hat { y } _ { i } - y _ { i } \right) x _ { i } $
  \EndFor  
  \State $w = w - \eta \Delta $
\Until{$|\Delta|\leq \epsilon$}
\end{algorithmic}
</div>
</div>

<div id="outline-container-org66dfb90" class="outline-3">
<h3 id="org66dfb90"><span class="section-number-3">1.7</span> Termination Criteria Considerations</h3>
<div class="outline-text-3" id="text-1-7">
<p>
The setting of terminating condition can be tricky for gradient descent
</p>
<ul class="org-ul">
<li>If terminates prematurely, the algorithm may not reach the global minimum</li>
<li>If there is a local minimum, the algorithm may get stuck in local minimum</li>
<li>If set an expected global minimum, it may never be reached by the algorithm</li>
</ul>
</div>
</div>

<div id="outline-container-org12aea49" class="outline-3">
<h3 id="org12aea49"><span class="section-number-3">1.8</span> Date snooping</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Looking at the data before choosing the model is problematic, can lead to a fallacy 
</p>
<ul class="org-ul">
<li>this is different from using human expertise knowledge for feature engineering, which can help the model</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc957f01" class="outline-2">
<h2 id="orgc957f01"><span class="section-number-2">2</span> Support Vector Machine</h2>
<div class="outline-text-2" id="text-2">
<p>
One of the most successful classification algorithm in machine learning. Given multiple decision boundaries that split the data, SVM seeks to find a <b><b>hyperplane</b></b> that separate the data, such that the <b><b>margin</b></b> is maximized to the nearest trained data points. It is a constrained optimization problem.
</p>
</div>
<div id="outline-container-orgb35c8ad" class="outline-3">
<h3 id="orgb35c8ad"><span class="section-number-3">2.1</span> Margin</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Given a linear decision boundary defined by \(w^Tx+b=0\). The functional margin for a point \((x^i, y^i)\) is defined as
\[
y^i(w^Tx^i + b)
\]
For a fixed w and b, the larger the functional value, the more confident we have about the prediction. However, the functional margin can be arbitrarily changed without changing the boundary at all. So we use geometric margin instead.
<b><b>Geometric Margin</b></b>
The distance between an example and the decision boundary.
For training set \(S=\{x^i, y^i\}: i = 1, ... N\) and boundary \(w^T+ b = 0\), compute the geometric margin of all points: 
\[\gamma^i = \frac{y^i(W \cdot X^i + b}{||W||}, i = 1, ..., N\]
Note: \(\gamma^i > 0\) if point i is correctly classified
We want to see if the smallest \(\gamma^i\) is large. 
\[\gamma =\min_{i=1...n} \gamma^i\]
</p>
</div>
</div>
<div id="outline-container-org6b81aeb" class="outline-3">
<h3 id="org6b81aeb"><span class="section-number-3">2.2</span> Optimization Problem</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Maximizing the geometric margin is equivalent to minimizing the magnitude of w subject to maintaining a functional margin of at least 1. 
\[ \min _ { w ,b } \frac { 1} { 2} \| \mathbf { w } \| ^ { 2} \]
\[ \text{ subject to } : y ^ { i } \left( \mathbf { w } \cdot \mathbf { x } ^ { i } + b \right) \geq 1,i = 1,\cdots ,N \]
Results in a quadratic optimization problem with linear inquality constraint. There are several algorithms for solving for QP. We can regard them as black box. The solution can be written in forms of 
\[ \mathbf { w } = \sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } x ^ { i } ,\quad s .t .\sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } = 0 \]  
The above equation provide the form for w, the value of b can be computed with some additional steps
</p>
<ul class="org-ul">
<li>w is a linear combination fo all training exampls</li>
<li>many points have zero \(\alpha\)&rsquo;s, which are the data points that have larger geometric margin</li>
<li>points that have non-zero \(\alpha\)&rsquo;s are called <b><b>support vector</b></b>, which are the data points that have smallest geometric margin</li>
</ul>
</div>
</div>

<div id="outline-container-org3a15107" class="outline-3">
<h3 id="org3a15107"><span class="section-number-3">2.3</span> Dealing with none linearly separable data</h3>
<div class="outline-text-3" id="text-2-3">
<p>
If data are not linearly separable or data have noise. It becomes difficult to use SVM. We have two ways to deal with these issues. 
</p>
</div>
</div>
