ml-notes.org
** Soft Margin 
Allow functional margin to be less than 1, or in some cases less than 0 . Adding the software margin to our equation, we have
$$ \min _ { w ,b } \| \mathbf { w } \| ^ { 2} + c \sum _ { i = 1} ^ { N } \xi _ { i } ^ { k } $$
$$
\text{ subject to } : y ^ { i } \left( \mathbf { w } \cdot \mathbf { x } ^ { i } + b \right) \geq 1- \xi _ { i } ,i = 1,\cdots ,N
$$
$$
\xi _ { i } \geq 0,i = 1,\cdots ,N
$$
With solution of 
$$
w = \sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } x ^ { i } ,\quad s .t \sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } = 0\text{ and } 0\leq a _ { i } \leq c
$$
- \xi can be viewed as errors 
- Tradeoff between maxmizing decision boundary margin and minimizing error
- Parameter c controls this tradeoff, c also puts a box constraints on $\alpha$ and limits the influence of individual support vector
- C is set by the algorithm implementer, and can be derived using cross-validation
** Mapping input space to higher dimension 
When dataset is too hard to seperate linearly using soft margin. We can map the input space to higher dimension such that the data points become linearly seperatable.
** Kernel Function
Kernel function is a function that maps input space to higher dimension. It can also be viewed measuring similarity. As a result, the decision boundary will be non-linear in the original input space.
- There are many kernel functions, the choice can be derived by cross-validation
Strengths
- solution is globally optimal
- Scales well with higher dimensional data
- Can handle non-traditional data like strings, trees
Weakness
- Need to choose a good kernel
- Can be computational expensive for large dataset

* Decision Tree
Use a tree structure for solving classification problems. Its strengths are 
1. Similar to human decision, high interpretability
2. Deals with discrete and continuous features without the need for transformation unlike perceptron and logistic regression
3. Highly flexible, can represent more complex decision boundaries by increasing nodes and depth  
The learning objective using decision tree is to find a decision tree h that achieves minimum error on training data. 
** Algorithm 
A top-down, greedy search approach
1. Choose the best test to be the root of tree
2. Create a descendant node for each test outcomes
3. Examples in training set S are sent to the appropriate descendent node based on the test outcome
4. Recursively apply at each descendent node using the subset of training samples
5. If all samples belong to the same class, turn it into a leaf node 

Choosing the best test, we aim to maximize the information gain. In other words, minimize entropy.

** Entropy
Entropy is a **measure of uncertainty**. If the probability is 1.0, there is no entropy. However, if the probability of an outcome over another is 0.5, the entropy is maximized.

 Let y be a categorical random variable that can take k different values: $v_1, v_2,...,v_k$ and $p_i=P(y=v_i)$  for $i=1,..,k$. The entropy of y, denoted as $H(y)$ is defined as: 
$$
H ( y ) = - \sum _ { i = 1} ^ { k } p _ { i } \log _ { 2} p _ { i }
$$
** Building decision tree
We need to choose the split that maximizes **benefit of split** which effecitvely measures the mutual information between the features x and class label y. The root is then selected based on information gain.  
$$
\text{ Benefit of split } = U ( S ) - \sum _ { i } ^ { m } p _ { i } U \left( S _ { i } \right)
$$
** Dealing with multi-nomial features  and continuous features
Multi-nominal: If a feature has more than two possible values. 
- can be problemic because there is a bias to prefer multinominal features to binary features.

Continuous features
- Compute a threshold that maximizes information gain, essentially convert it to a binary feature  
- Both continuous features and discrete features can be used to formulate a decision tree 

** Over-fitting 
Due to being highly flexible, the decision tree is prone to over-fitting. Two interventions can combat that
1. Early stop
   - stop growing the tree when data split does not offer large benefits
2. Post-pruning
   - Separate training data into a training set and validating set
   - Compute the impact on validation set when pruning each possible node 
   - Prune the node that improves the validation set performance in a greedy fashion

