ml-notes.html

<div id="outline-container-org5a9e0c6" class="outline-3">
<h3 id="org5a9e0c6"><span class="section-number-3">2.4</span> Soft Margin</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Allow functional margin to be less than 1, or in some cases less than 0 . Adding the software margin to our equation, we have
\[ \min _ { w ,b } \| \mathbf { w } \| ^ { 2} + c \sum _ { i = 1} ^ { N } \xi _ { i } ^ { k } \]
\[
\text{ subject to } : y ^ { i } \left( \mathbf { w } \cdot \mathbf { x } ^ { i } + b \right) \geq 1- \xi _ { i } ,i = 1,\cdots ,N
\]
\[
\xi _ { i } \geq 0,i = 1,\cdots ,N
\]
With solution of 
\[
w = \sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } x ^ { i } ,\quad s .t \sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } = 0\text{ and } 0\leq a _ { i } \leq c
\]
</p>
<ul class="org-ul">
<li>&xi; can be viewed as errors</li>
<li>Tradeoff between maxmizing decision boundary margin and minimizing error</li>
<li>Parameter c controls this tradeoff, c also puts a box constraints on \(\alpha\) and limits the influence of individual support vector</li>
<li>C is set by the algorithm implementer, and can be derived using cross-validation</li>
</ul>
</div>
</div>
<div id="outline-container-org849ef51" class="outline-3">
<h3 id="org849ef51"><span class="section-number-3">2.5</span> Mapping input space to higher dimension</h3>
<div class="outline-text-3" id="text-2-5">
<p>
When dataset is too hard to seperate linearly using soft margin. We can map the input space to higher dimension such that the data points become linearly seperatable.
</p>
</div>
</div>
<div id="outline-container-orgeab858e" class="outline-3">
<h3 id="orgeab858e"><span class="section-number-3">2.6</span> Kernel Function</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Kernel function is a function that maps input space to higher dimension. It can also be viewed measuring similarity. As a result, the decision boundary will be non-linear in the original input space.
</p>
<ul class="org-ul">
<li>There are many kernel functions, the choice can be derived by cross-validation</li>
</ul>
<p>
Strengths
</p>
<ul class="org-ul">
<li>solution is globally optimal</li>
<li>Scales well with higher dimensional data</li>
<li>Can handle non-traditional data like strings, trees</li>
</ul>
<p>
Weakness
</p>
<ul class="org-ul">
<li>Need to choose a good kernel</li>
<li>Can be computational expensive for large dataset</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgca3e68d" class="outline-2">
<h2 id="orgca3e68d"><span class="section-number-2">3</span> Decision Tree</h2>
<div class="outline-text-2" id="text-3">
<p>
Use a tree structure for solving classification problems. Its strengths are 
</p>
<ol class="org-ol">
<li>Similar to human decision, high interpretability</li>
<li>Deals with discrete and continuous features without the need for transformation unlike perceptron and logistic regression</li>
<li>Highly flexible, can represent more complex decision boundaries by increasing nodes and depth</li>
</ol>
<p>
The learning objective using decision tree is to find a decision tree h that achieves minimum error on training data. 
</p>
</div>
<div id="outline-container-org97d0750" class="outline-3">
<h3 id="org97d0750"><span class="section-number-3">3.1</span> Algorithm</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A top-down, greedy search approach
</p>
<ol class="org-ol">
<li>Choose the best test to be the root of tree</li>
<li>Create a descendant node for each test outcomes</li>
<li>Examples in training set S are sent to the appropriate descendent node based on the test outcome</li>
<li>Recursively apply at each descendent node using the subset of training samples</li>
<li>If all samples belong to the same class, turn it into a leaf node</li>
</ol>

<p>
Choosing the best test, we aim to maximize the information gain. In other words, minimize entropy.
</p>
</div>
</div>

<div id="outline-container-org5a0be2a" class="outline-3">
<h3 id="org5a0be2a"><span class="section-number-3">3.2</span> Entropy</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Entropy is a <b><b>measure of uncertainty</b></b>. If the probability is 1.0, there is no entropy. However, if the probability of an outcome over another is 0.5, the entropy is maximized.
</p>

<p>
Let y be a categorical random variable that can take k different values: \(v_1, v_2,...,v_k\) and \(p_i=P(y=v_i)\)  for \(i=1,..,k\). The entropy of y, denoted as \(H(y)\) is defined as: 
\[
H ( y ) = - \sum _ { i = 1} ^ { k } p _ { i } \log _ { 2} p _ { i }
\]
</p>
</div>
</div>
<div id="outline-container-orgdf5ca26" class="outline-3">
<h3 id="orgdf5ca26"><span class="section-number-3">3.3</span> Building decision tree</h3>
<div class="outline-text-3" id="text-3-3">
<p>
We need to choose the split that maximizes <b><b>benefit of split</b></b> which effecitvely measures the mutual information between the features x and class label y. The root is then selected based on information gain.  
\[
\text{ Benefit of split } = U ( S ) - \sum _ { i } ^ { m } p _ { i } U \left( S _ { i } \right)
\]
</p>
</div>
</div>
<div id="outline-container-org5b54601" class="outline-3">
<h3 id="org5b54601"><span class="section-number-3">3.4</span> Dealing with multi-nomial features  and continuous features</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Multi-nominal: If a feature has more than two possible values. 
</p>
<ul class="org-ul">
<li>can be problemic because there is a bias to prefer multinominal features to binary features.</li>
</ul>

<p>
Continuous features
</p>
<ul class="org-ul">
<li>Compute a threshold that maximizes information gain, essentially convert it to a binary feature</li>
<li>Both continuous features and discrete features can be used to formulate a decision tree</li>
</ul>
</div>
</div>

<div id="outline-container-org74a8551" class="outline-3">
<h3 id="org74a8551"><span class="section-number-3">3.5</span> Over-fitting</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Due to being highly flexible, the decision tree is prone to over-fitting. Two interventions can combat that
</p>
<ol class="org-ol">
<li>Early stop
<ul class="org-ul">
<li>stop growing the tree when data split does not offer large benefits</li>
</ul></li>
<li>Post-pruning
<ul class="org-ul">
<li>Separate training data into a training set and validating set</li>
<li>Compute the impact on validation set when pruning each possible node</li>
<li>Prune the node that improves the validation set performance in a greedy fashion</li>
</ul></li>
</ol>
</div>
</div>
