ml-notes.tex

\subsection{Soft Margin}
\label{sec:orgc87ed8a}
Allow functional margin to be less than 1, or in some cases less than 0 . Adding the software margin to our equation, we have
$$ \min _ { w ,b } \| \mathbf { w } \| ^ { 2} + c \sum _ { i = 1} ^ { N } \xi _ { i } ^ { k } $$
$$
\text{ subject to } : y ^ { i } \left( \mathbf { w } \cdot \mathbf { x } ^ { i } + b \right) \geq 1- \xi _ { i } ,i = 1,\cdots ,N
$$
$$
\xi _ { i } \geq 0,i = 1,\cdots ,N
$$
With solution of 
$$
w = \sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } x ^ { i } ,\quad s .t \sum _ { i = 1} ^ { N } \alpha _ { i } y ^ { i } = 0\text{ and } 0\leq a _ { i } \leq c
$$
\begin{itemize}
\item \(\xi\) can be viewed as errors
\item Tradeoff between maxmizing decision boundary margin and minimizing error
\item Parameter c controls this tradeoff, c also puts a box constraints on \(\alpha\) and limits the influence of individual support vector
\item C is set by the algorithm implementer, and can be derived using cross-validation
\end{itemize}
\subsection{Mapping input space to higher dimension}
\label{sec:orgf54963d}
When dataset is too hard to seperate linearly using soft margin. We can map the input space to higher dimension such that the data points become linearly seperatable.
\subsection{Kernel Function}
\label{sec:orgb69172f}
Kernel function is a function that maps input space to higher dimension. It can also be viewed measuring similarity. As a result, the decision boundary will be non-linear in the original input space.
\begin{itemize}
\item There are many kernel functions, the choice can be derived by cross-validation
\end{itemize}
Strengths
\begin{itemize}
\item solution is globally optimal
\item Scales well with higher dimensional data
\item Can handle non-traditional data like strings, trees
\end{itemize}
Weakness
\begin{itemize}
\item Need to choose a good kernel
\item Can be computational expensive for large dataset
\end{itemize}

\section{Decision Tree}
\label{sec:org33b79f1}
Use a tree structure for solving classification problems. Its strengths are 
\begin{enumerate}
\item Similar to human decision, high interpretability
\item Deals with discrete and continuous features without the need for transformation unlike perceptron and logistic regression
\item Highly flexible, can represent more complex decision boundaries by increasing nodes and depth
\end{enumerate}
The learning objective using decision tree is to find a decision tree h that achieves minimum error on training data. 
\subsection{Algorithm}
\label{sec:org3870dab}
A top-down, greedy search approach
\begin{enumerate}
\item Choose the best test to be the root of tree
\item Create a descendant node for each test outcomes
\item Examples in training set S are sent to the appropriate descendent node based on the test outcome
\item Recursively apply at each descendent node using the subset of training samples
\item If all samples belong to the same class, turn it into a leaf node
\end{enumerate}

Choosing the best test, we aim to maximize the information gain. In other words, minimize entropy.

\subsection{Entropy}
\label{sec:orgc1d794a}
Entropy is a \textbf{\textbf{measure of uncertainty}}. If the probability is 1.0, there is no entropy. However, if the probability of an outcome over another is 0.5, the entropy is maximized.

Let y be a categorical random variable that can take k different values: \(v_1, v_2,...,v_k\) and \(p_i=P(y=v_i)\)  for \(i=1,..,k\). The entropy of y, denoted as \(H(y)\) is defined as: 
$$
H ( y ) = - \sum _ { i = 1} ^ { k } p _ { i } \log _ { 2} p _ { i }
$$
\subsection{Building decision tree}
\label{sec:org306ebf2}
We need to choose the split that maximizes \textbf{\textbf{benefit of split}} which effecitvely measures the mutual information between the features x and class label y. The root is then selected based on information gain.  
$$
\text{ Benefit of split } = U ( S ) - \sum _ { i } ^ { m } p _ { i } U \left( S _ { i } \right)
$$
\subsection{Dealing with multi-nomial features  and continuous features}
\label{sec:org0ad525a}
Multi-nominal: If a feature has more than two possible values. 
\begin{itemize}
\item can be problemic because there is a bias to prefer multinominal features to binary features.
\end{itemize}

Continuous features
\begin{itemize}
\item Compute a threshold that maximizes information gain, essentially convert it to a binary feature
\item Both continuous features and discrete features can be used to formulate a decision tree
\end{itemize}

\subsection{Over-fitting}
\label{sec:org3795ac1}
Due to being highly flexible, the decision tree is prone to over-fitting. Two interventions can combat that
\begin{enumerate}
\item Early stop
\begin{itemize}
\item stop growing the tree when data split does not offer large benefits
\end{itemize}
\item Post-pruning
\begin{itemize}
\item Separate training data into a training set and validating set
\item Compute the impact on validation set when pruning each possible node
\item Prune the node that improves the validation set performance in a greedy fashion
\end{itemize}
\end{enumerate}
