ml-notes.org
** Regression Tree
Using decision tree to apply for regression problems. Prediction is computed as the average of the target values of all examples in the leaf node. Uncertainty is measured by the sum of squared errors within the node.

* Questions
1. The mechanism of Kernel function in SVM in mapping to higher dimension? 
2. The concept of information gain in decision tree?
3. In choosing between linear models and SVM? Can overfitting be an issue in SVM?

* Machine Learning Handson
  Investigate a dateset of cancer microarray, and use machine learning model to to predict the outcome   
** Make machine learning research reproducible, make it pubic
- All optimal tuning parameters chosen for each technique evaluated  
- The pseudocode for the data partitions
- The number of replicates performed to obtain the average test errors
- The seed used as the entry point into the random number generator during replication process
* Feature engineering
** Feature subset selection
Removing features that are not relevant or are redundant, very helpful for high dimensional data. There are three type of feature selection algorithms
** The filters which extract features from the data without any learning involved
Gene ranking as a popular statistical method, which ranks gene in the dataset by their significance
- Unconditional Mixture Modelling (univariate): assume two different states of gene on and off, and checks whether the underlying binary state of gene affects the classification using mixture overlap probability
- Information Gain Ranking (univariate): approximates the conditional distribute P(C|F), where C is the class label and F is the feature vector. Information gain is used as a surrogate for the conditional distribution  
- Markov Blanket Filtering (univariete): finds the features that are independent of the class label so that removing them will not affect the accuracy  
** Dealing with missing values 
Three ways 
1. Remove the column with missing values, may be used if column contains mostly missing values
- loss of information
2. Imputation: replace the missing value with some number. Scikit-learn's imputation library replace values with mean by default. 
- a better option most of time
** Dealing with Categorical data
- One-Hot Encoding: create new binary columns for each category

* Visualization of High Dimensional Data
** TSNE
- TSNE: converts similarities between data point to join probabilities and tries to minimize the Kullback-Leibler divergence between the joint probabilities of the low-dimensional embedding and the high-dimensional data  

* Experiment Design for ML algorithm Evaluation
**Sparse**: when a feature have most its entries as zeros.
- sparse maxtrix: a matrix contains mostly zero values
- dense matrix: a matrix contains mostly non-zero values
** Why high sparsity is desired in many ML applications? 
   1. Many real datasets such as texts and Microarray data are represented as very high dimensional vectors
   2. Most features in high dimensional vectors are usually non-informative or noisy and may serious affect the generalization performance
   3. A sparse classifier can lead to a simplified decision rule for faster prediction in large-scale problems    
** Performance Matrice
- accuracy
- AUC: area under ROC curve
- squared loss
** Models that perform well across low-dimension to high-dimension data
- Random Forest, Neural nets, Boosted Tree, and SVMS
