ml-notes.html

<div id="outline-container-org0957204" class="outline-3">
<h3 id="org0957204"><span class="section-number-3">3.6</span> Regression Tree</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Using decision tree to apply for regression problems. Prediction is computed as the average of the target values of all examples in the leaf node. Uncertainty is measured by the sum of squared errors within the node.
</p>
</div>
</div>
</div>

<div id="outline-container-org4fe4220" class="outline-2">
<h2 id="org4fe4220"><span class="section-number-2">4</span> Questions</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>The mechanism of Kernel function in SVM in mapping to higher dimension?</li>
<li>The concept of information gain in decision tree?</li>
<li>In choosing between linear models and SVM? Can overfitting be an issue in SVM?</li>
</ol>
</div>
</div>

<div id="outline-container-orgd61166d" class="outline-2">
<h2 id="orgd61166d"><span class="section-number-2">5</span> Machine Learning Handson</h2>
<div class="outline-text-2" id="text-5">
<p>
Investigate a dateset of cancer microarray, and use machine learning model to to predict the outcome   
</p>
</div>
<div id="outline-container-org533f2d9" class="outline-3">
<h3 id="org533f2d9"><span class="section-number-3">5.1</span> Make machine learning research reproducible, make it pubic</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>All optimal tuning parameters chosen for each technique evaluated</li>
<li>The pseudocode for the data partitions</li>
<li>The number of replicates performed to obtain the average test errors</li>
<li>The seed used as the entry point into the random number generator during replication process</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgba1076e" class="outline-2">
<h2 id="orgba1076e"><span class="section-number-2">6</span> Feature engineering</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgf731fc3" class="outline-3">
<h3 id="orgf731fc3"><span class="section-number-3">6.1</span> Feature subset selection</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Removing features that are not relevant or are redundant, very helpful for high dimensional data. There are three type of feature selection algorithms
</p>
</div>
</div>
<div id="outline-container-org759b946" class="outline-3">
<h3 id="org759b946"><span class="section-number-3">6.2</span> The filters which extract features from the data without any learning involved</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Gene ranking as a popular statistical method, which ranks gene in the dataset by their significance
</p>
<ul class="org-ul">
<li>Unconditional Mixture Modelling (univariate): assume two different states of gene on and off, and checks whether the underlying binary state of gene affects the classification using mixture overlap probability</li>
<li>Information Gain Ranking (univariate): approximates the conditional distribute P(C|F), where C is the class label and F is the feature vector. Information gain is used as a surrogate for the conditional distribution</li>
<li>Markov Blanket Filtering (univariete): finds the features that are independent of the class label so that removing them will not affect the accuracy</li>
</ul>
</div>
</div>
<div id="outline-container-orgd4e4cd1" class="outline-3">
<h3 id="orgd4e4cd1"><span class="section-number-3">6.3</span> Dealing with missing values</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Three ways 
</p>
<ol class="org-ol">
<li>Remove the column with missing values, may be used if column contains mostly missing values</li>
<li>loss of information</li>
<li>Imputation: replace the missing value with some number. Scikit-learn&rsquo;s imputation library replace values with mean by default.</li>
<li>a better option most of time</li>
</ol>
</div>
</div>
<div id="outline-container-org5673e18" class="outline-3">
<h3 id="org5673e18"><span class="section-number-3">6.4</span> Dealing with Categorical data</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>One-Hot Encoding: create new binary columns for each category</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgad36962" class="outline-2">
<h2 id="orgad36962"><span class="section-number-2">7</span> Visualization of High Dimensional Data</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org9179e32" class="outline-3">
<h3 id="org9179e32"><span class="section-number-3">7.1</span> TSNE</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>TSNE: converts similarities between data point to join probabilities and tries to minimize the Kullback-Leibler divergence between the joint probabilities of the low-dimensional embedding and the high-dimensional data</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1e0645b" class="outline-2">
<h2 id="org1e0645b"><span class="section-number-2">8</span> Experiment Design for ML algorithm Evaluation</h2>
<div class="outline-text-2" id="text-8">
<p>
<b><b>Sparse</b></b>: when a feature have most its entries as zeros.
</p>
<ul class="org-ul">
<li>sparse maxtrix: a matrix contains mostly zero values</li>
<li>dense matrix: a matrix contains mostly non-zero values</li>
</ul>
</div>
<div id="outline-container-orge0fe96e" class="outline-3">
<h3 id="orge0fe96e"><span class="section-number-3">8.1</span> Why high sparsity is desired in many ML applications?</h3>
<div class="outline-text-3" id="text-8-1">
<ol class="org-ol">
<li>Many real datasets such as texts and Microarray data are represented as very high dimensional vectors</li>
<li>Most features in high dimensional vectors are usually non-informative or noisy and may serious affect the generalization performance</li>
<li>A sparse classifier can lead to a simplified decision rule for faster prediction in large-scale problems</li>
</ol>
</div>
</div>
<div id="outline-container-orga88818f" class="outline-3">
<h3 id="orga88818f"><span class="section-number-3">8.2</span> Performance Matrice</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>accuracy</li>
<li>AUC: area under ROC curve</li>
<li>squared loss</li>
</ul>
</div>
</div>
<div id="outline-container-org25b30a6" class="outline-3">
<h3 id="org25b30a6"><span class="section-number-3">8.3</span> Models that perform well across low-dimension to high-dimension data</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>Random Forest, Neural nets, Boosted Tree, and SVMS</li>
</ul>
</div>
</div>
</div>
