ml-notes.tex

\subsection{Regression Tree}
\label{sec:org1cd8db4}
Using decision tree to apply for regression problems. Prediction is computed as the average of the target values of all examples in the leaf node. Uncertainty is measured by the sum of squared errors within the node.

\section{Questions}
\label{sec:org2a06606}
\begin{enumerate}
\item The mechanism of Kernel function in SVM in mapping to higher dimension?
\item The concept of information gain in decision tree?
\item In choosing between linear models and SVM? Can overfitting be an issue in SVM?
\end{enumerate}

\section{Machine Learning Handson}
\label{sec:orgc038330}
Investigate a dateset of cancer microarray, and use machine learning model to to predict the outcome   
\subsection{Make machine learning research reproducible, make it pubic}
\label{sec:org528d9a7}
\begin{itemize}
\item All optimal tuning parameters chosen for each technique evaluated
\item The pseudocode for the data partitions
\item The number of replicates performed to obtain the average test errors
\item The seed used as the entry point into the random number generator during replication process
\end{itemize}
\section{Feature engineering}
\label{sec:org98f8030}
\subsection{Feature subset selection}
\label{sec:orgd9aa744}
Removing features that are not relevant or are redundant, very helpful for high dimensional data. There are three type of feature selection algorithms
\subsection{The filters which extract features from the data without any learning involved}
\label{sec:org330101b}
Gene ranking as a popular statistical method, which ranks gene in the dataset by their significance
\begin{itemize}
\item Unconditional Mixture Modelling (univariate): assume two different states of gene on and off, and checks whether the underlying binary state of gene affects the classification using mixture overlap probability
\item Information Gain Ranking (univariate): approximates the conditional distribute P(C|F), where C is the class label and F is the feature vector. Information gain is used as a surrogate for the conditional distribution
\item Markov Blanket Filtering (univariete): finds the features that are independent of the class label so that removing them will not affect the accuracy
\end{itemize}
\subsection{Dealing with missing values}
\label{sec:org77a35ab}
Three ways 
\begin{enumerate}
\item Remove the column with missing values, may be used if column contains mostly missing values
\item loss of information
\item Imputation: replace the missing value with some number. Scikit-learn's imputation library replace values with mean by default.
\item a better option most of time
\end{enumerate}
\subsection{Dealing with Categorical data}
\label{sec:org8784723}
\begin{itemize}
\item One-Hot Encoding: create new binary columns for each category
\end{itemize}

\section{Visualization of High Dimensional Data}
\label{sec:org74fc431}
\subsection{TSNE}
\label{sec:orgb40e696}
\begin{itemize}
\item TSNE: converts similarities between data point to join probabilities and tries to minimize the Kullback-Leibler divergence between the joint probabilities of the low-dimensional embedding and the high-dimensional data
\end{itemize}

\section{Experiment Design for ML algorithm Evaluation}
\label{sec:org93fb156}
\textbf{\textbf{Sparse}}: when a feature have most its entries as zeros.
\begin{itemize}
\item sparse maxtrix: a matrix contains mostly zero values
\item dense matrix: a matrix contains mostly non-zero values
\end{itemize}
\subsection{Why high sparsity is desired in many ML applications?}
\label{sec:org705ac8f}
\begin{enumerate}
\item Many real datasets such as texts and Microarray data are represented as very high dimensional vectors
\item Most features in high dimensional vectors are usually non-informative or noisy and may serious affect the generalization performance
\item A sparse classifier can lead to a simplified decision rule for faster prediction in large-scale problems
\end{enumerate}
\subsection{Performance Matrice}
\label{sec:org8d5673d}
\begin{itemize}
\item accuracy
\item AUC: area under ROC curve
\item squared loss
\end{itemize}
\subsection{Models that perform well across low-dimension to high-dimension data}
\label{sec:orga29e458}
\begin{itemize}
\item Random Forest, Neural nets, Boosted Tree, and SVMS
\end{itemize}
