ml-notes.org
* XGBoost
XGBoosst is the leading model for working with standard tabular data (eg. in Pandas Dataframe). It requires more knowledge and model tuning. It is an implementation of the gradient boosted decision trees algorithm.
- start with a baseline prediction, create cycles that repeatedly builds new models and combines them into an ensemble model
- to make a prediction, we add the predictions from all previous models
- n estimator is key parameter to tune, too small leads to underfitting, and too large leads to overfitting
- early stopping rounds is another parameter can stop the algorithm automatically when model stops improving
- learning rate allows early predictions to have smaller weight, and later ones have a larger weight. So we can use a larger n estimator value with learning rate
- n jobs is a parameter can be set to number of cores to take advantage of parallism

* Pipelines
A pipeline bundles preprocessing and modeling steps so you can use the whole bundle as if it were a single step. It involves defining the steps of applying transformors to the data, then train the models. Benefits include
1. cleaner code
2. fewer bugs
3. easier to productionize
4. more options for model testing

* Cross Validation
Provide a more accurate measure of model quality by fold the data into partitions.
- lower score means better model quality

* Data leakage
Leakage causes a model to look accurate until making predictions with the model. Any variable that updates after target values is realized can cause data leakage, so they should be excluded from the feature set. 
- Data leakage can cause major problem in ML production, need to be careful 

* General Visualization
** Partial Dependence Plots
Show how each variable or predictor affects the model's predictions after the model is fitted. Improve the interpretability.   
* Debugging and Error Analysis 
Error analysis is crucial when applying machine learning to real world problems.
[http://cs229.stanford.edu/materials/ML-advice.pdf]
** Debugging learning algorithms 
*** high variance or overfitting: if error is low on training but high on testing. Overlearning the training data but no generalizing well
  - increase training samples 
  - a smaller set of features  
*** high bias: if error is high on training regardless of training samples. Not enough features to learn the problem
  - a larger set of features
  - design better features
*** algorithm not converging
- run gradient descent for more iterations
- use Newton's method
*** Not optimizing the right objective function
- parameter tuning current algorithm 
- try another algorithm
** Error analysis vs. ablative analysis
*** Error analysis tries to explain the difference between current performance and perfect performance.  
*** Ablative analysis tries to explain the difference between some baseline performance and current performance. Eg. consider a image recognition algorithm with baseline performance of 94%, and best performance of 99%. 
** Two approaches to ML problems 
1. careful design: try to design the right features, dataset and algorithm architecture. 
   - pro: maybe more scalable
   - con:Be careful with premature optimization
2. build and fix: implement something quick, then run error analyses to fix its errors. 
   - pro: faster to market
* misc 
** treatment effect 
The difference between treated and untreated group
** parameteric 
Assume data is drawn from normal distribution
** non-parameteric  
Does not assume data to have normal distribution
