ml-notes.html
<div id="outline-container-orga4b22b7" class="outline-2">
<h2 id="orga4b22b7"><span class="section-number-2">9</span> XGBoost</h2>
<div class="outline-text-2" id="text-9">
<p>
XGBoosst is the leading model for working with standard tabular data (eg. in Pandas Dataframe). It requires more knowledge and model tuning. It is an implementation of the gradient boosted decision trees algorithm.
</p>
<ul class="org-ul">
<li>start with a baseline prediction, create cycles that repeatedly builds new models and combines them into an ensemble model</li>
<li>to make a prediction, we add the predictions from all previous models</li>
<li>n estimator is key parameter to tune, too small leads to underfitting, and too large leads to overfitting</li>
<li>early stopping rounds is another parameter can stop the algorithm automatically when model stops improving</li>
<li>learning rate allows early predictions to have smaller weight, and later ones have a larger weight. So we can use a larger n estimator value with learning rate</li>
<li>n jobs is a parameter can be set to number of cores to take advantage of parallism</li>
</ul>
</div>
</div>

<div id="outline-container-org29bc632" class="outline-2">
<h2 id="org29bc632"><span class="section-number-2">10</span> Pipelines</h2>
<div class="outline-text-2" id="text-10">
<p>
A pipeline bundles preprocessing and modeling steps so you can use the whole bundle as if it were a single step. It involves defining the steps of applying transformors to the data, then train the models. Benefits include
</p>
<ol class="org-ol">
<li>cleaner code</li>
<li>fewer bugs</li>
<li>easier to productionize</li>
<li>more options for model testing</li>
</ol>
</div>
</div>

<div id="outline-container-org06bcf68" class="outline-2">
<h2 id="org06bcf68"><span class="section-number-2">11</span> Cross Validation</h2>
<div class="outline-text-2" id="text-11">
<p>
Provide a more accurate measure of model quality by fold the data into partitions.
</p>
<ul class="org-ul">
<li>lower score means better model quality</li>
</ul>
</div>
</div>

<div id="outline-container-orgc692fd1" class="outline-2">
<h2 id="orgc692fd1"><span class="section-number-2">12</span> Data leakage</h2>
<div class="outline-text-2" id="text-12">
<p>
Leakage causes a model to look accurate until making predictions with the model. Any variable that updates after target values is realized can cause data leakage, so they should be excluded from the feature set. 
</p>
<ul class="org-ul">
<li>Data leakage can cause major problem in ML production, need to be careful</li>
</ul>
</div>
</div>

<div id="outline-container-org44a213b" class="outline-2">
<h2 id="org44a213b"><span class="section-number-2">13</span> General Visualization</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgaf40acc" class="outline-3">
<h3 id="orgaf40acc"><span class="section-number-3">13.1</span> Partial Dependence Plots</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Show how each variable or predictor affects the model&rsquo;s predictions after the model is fitted. Improve the interpretability.   
</p>
</div>
</div>
</div>
<div id="outline-container-org7ef7f12" class="outline-2">
<h2 id="org7ef7f12"><span class="section-number-2">14</span> Debugging and Error Analysis</h2>
<div class="outline-text-2" id="text-14">
<p>
Error analysis is crucial when applying machine learning to real world problems.
[<a href="http://cs229.stanford.edu/materials/ML-advice.pdf">http://cs229.stanford.edu/materials/ML-advice.pdf</a>]
</p>
</div>
<div id="outline-container-orgd1e85b8" class="outline-3">
<h3 id="orgd1e85b8"><span class="section-number-3">14.1</span> Debugging learning algorithms</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-org633457b" class="outline-4">
<h4 id="org633457b"><span class="section-number-4">14.1.1</span> high variance or overfitting: if error is low on training but high on testing. Overlearning the training data but no generalizing well</h4>
<div class="outline-text-4" id="text-14-1-1">
<ul class="org-ul">
<li>increase training samples</li>
<li>a smaller set of features</li>
</ul>
</div>
</div>
<div id="outline-container-org4b682ae" class="outline-4">
<h4 id="org4b682ae"><span class="section-number-4">14.1.2</span> high bias: if error is high on training regardless of training samples. Not enough features to learn the problem</h4>
<div class="outline-text-4" id="text-14-1-2">
<ul class="org-ul">
<li>a larger set of features</li>
<li>design better features</li>
</ul>
</div>
</div>
<div id="outline-container-org8655dc9" class="outline-4">
<h4 id="org8655dc9"><span class="section-number-4">14.1.3</span> algorithm not converging</h4>
<div class="outline-text-4" id="text-14-1-3">
<ul class="org-ul">
<li>run gradient descent for more iterations</li>
<li>use Newton&rsquo;s method</li>
</ul>
</div>
</div>
<div id="outline-container-org0765e28" class="outline-4">
<h4 id="org0765e28"><span class="section-number-4">14.1.4</span> Not optimizing the right objective function</h4>
<div class="outline-text-4" id="text-14-1-4">
<ul class="org-ul">
<li>parameter tuning current algorithm</li>
<li>try another algorithm</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4b69ce7" class="outline-3">
<h3 id="org4b69ce7"><span class="section-number-3">14.2</span> Error analysis vs. ablative analysis</h3>
<div class="outline-text-3" id="text-14-2">
</div>
<div id="outline-container-orgc9c1607" class="outline-4">
<h4 id="orgc9c1607"><span class="section-number-4">14.2.1</span> Error analysis tries to explain the difference between current performance and perfect performance.</h4>
</div>
<div id="outline-container-org93c6672" class="outline-4">
<h4 id="org93c6672"><span class="section-number-4">14.2.2</span> Ablative analysis tries to explain the difference between some baseline performance and current performance. Eg. consider a image recognition algorithm with baseline performance of 94%, and best performance of 99%.</h4>
</div>
</div>
<div id="outline-container-org1419644" class="outline-3">
<h3 id="org1419644"><span class="section-number-3">14.3</span> Two approaches to ML problems</h3>
<div class="outline-text-3" id="text-14-3">
<ol class="org-ol">
<li>careful design: try to design the right features, dataset and algorithm architecture. 
<ul class="org-ul">
<li>pro: maybe more scalable</li>
<li>con:Be careful with premature optimization</li>
</ul></li>
<li>build and fix: implement something quick, then run error analyses to fix its errors. 
<ul class="org-ul">
<li>pro: faster to market</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf056a2c" class="outline-2">
<h2 id="orgf056a2c"><span class="section-number-2">15</span> misc</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org6d3b27c" class="outline-3">
<h3 id="org6d3b27c"><span class="section-number-3">15.1</span> treatment effect</h3>
<div class="outline-text-3" id="text-15-1">
<p>
The difference between treated and untreated group
</p>
</div>
</div>
<div id="outline-container-orgba99546" class="outline-3">
<h3 id="orgba99546"><span class="section-number-3">15.2</span> parameteric</h3>
<div class="outline-text-3" id="text-15-2">
<p>
Assume data is drawn from normal distribution
</p>
</div>
</div>
<div id="outline-container-orgce415c2" class="outline-3">
<h3 id="orgce415c2"><span class="section-number-3">15.3</span> non-parameteric</h3>
<div class="outline-text-3" id="text-15-3">
<p>
Does not assume data to have normal distribution
</p>
</div>
</div>
