ml-notes.tex
\section{XGBoost}
\label{sec:orgaf89eea}
XGBoosst is the leading model for working with standard tabular data (eg. in Pandas Dataframe). It requires more knowledge and model tuning. It is an implementation of the gradient boosted decision trees algorithm.
\begin{itemize}
\item start with a baseline prediction, create cycles that repeatedly builds new models and combines them into an ensemble model
\item to make a prediction, we add the predictions from all previous models
\item n estimator is key parameter to tune, too small leads to underfitting, and too large leads to overfitting
\item early stopping rounds is another parameter can stop the algorithm automatically when model stops improving
\item learning rate allows early predictions to have smaller weight, and later ones have a larger weight. So we can use a larger n estimator value with learning rate
\item n jobs is a parameter can be set to number of cores to take advantage of parallism
\end{itemize}

\section{Pipelines}
\label{sec:org8d7c60a}
A pipeline bundles preprocessing and modeling steps so you can use the whole bundle as if it were a single step. It involves defining the steps of applying transformors to the data, then train the models. Benefits include
\begin{enumerate}
\item cleaner code
\item fewer bugs
\item easier to productionize
\item more options for model testing
\end{enumerate}

\section{Cross Validation}
\label{sec:orgf4bcb24}
Provide a more accurate measure of model quality by fold the data into partitions.
\begin{itemize}
\item lower score means better model quality
\end{itemize}

\section{Data leakage}
\label{sec:org93f9a6d}
Leakage causes a model to look accurate until making predictions with the model. Any variable that updates after target values is realized can cause data leakage, so they should be excluded from the feature set. 
\begin{itemize}
\item Data leakage can cause major problem in ML production, need to be careful
\end{itemize}

\section{General Visualization}
\label{sec:orgbc77d49}
\subsection{Partial Dependence Plots}
\label{sec:org0c5a188}
Show how each variable or predictor affects the model's predictions after the model is fitted. Improve the interpretability.   
\section{Debugging and Error Analysis}
\label{sec:orgd592c9d}
Error analysis is crucial when applying machine learning to real world problems.
[\url{http://cs229.stanford.edu/materials/ML-advice.pdf}]
\subsection{Debugging learning algorithms}
\label{sec:orgfc808d8}
\begin{itemize}
\item high variance or overfitting: if error is low on training but high on testing. Overlearning the training data but no generalizing well
\begin{itemize}
\item increase training samples
\item a smaller set of features
\end{itemize}
\item high bias: if error is high on training regardless of training samples. Not enough features to learn the problem
\begin{itemize}
\item a larger set of features
\item design better features
\end{itemize}
\item algorithm not converging
\item run gradient descent for more iterations
\item use Newton's method
\item Not optimizing the right objective function
\item parameter tuning current algorithm
\item try another algorithm
\end{itemize}
\subsection{Error analysis vs. ablative analysis}
\label{sec:org62f0942}
\begin{itemize}
\item Error analysis tries to explain the difference between current performance and perfect performance.
\item Ablative analysis tries to explain the difference between some baseline performance and current performance. Eg. consider a image recognition algorithm with baseline performance of 94\%, and best performance of 99\%.
\end{itemize}
\subsection{Two approaches to ML problems}
\label{sec:orgf18d0d7}
\begin{enumerate}
\item careful design: try to design the right features, dataset and algorithm architecture. 
\begin{itemize}
\item pro: maybe more scalable
\item con:Be careful with premature optimization
\end{itemize}
\item build and fix: implement something quick, then run error analyses to fix its errors. 
\begin{itemize}
\item pro: faster to market
\end{itemize}
\end{enumerate}
\section{misc}
\label{sec:org354c076}
\subsection{treatment effect}
\label{sec:org6a51cdb}
The difference between treated and untreated group
\subsection{parameteric}
\label{sec:org4825f2c}
Assume data is drawn from normal distribution
\subsection{non-parameteric}
\label{sec:orgcc90707}
Does not assume data to have normal distribution
