ml-notes.org
** unconfoundedness
An assumption that confounding variables are measured in the dataset  

* Foundations
** Probability Theory
*** Bayesian Probability
An intepretation of the concept of probability. Instead of frequency or propensity of some phenomenon, probability is intepreted as reasonable expectation representing a state of knowledge or as quantification of a personal belief.     
- Bayes' therom to convert prior probability to posterior probability based on evidences provided by the observed data
- The effect of observed data $D = {t_1,..., t_n}$ is expressed through conditional probability $p(D|w)$
$$
p ( \mathbf { w } | \mathcal { D } ) = \frac { p ( \mathcal { D } | \mathbf { w } ) p ( \mathbf { w } ) } { p ( \mathcal { D } ) }
$$
$p(D|w)$ is learned from observed data, is called the **likelihood function**.
Given the definition of likelihood. We state Bayes' therom as 
$$
\text { posterior } \propto \text { likelihood } \times \text { prior }
$$
- negative log of the likelihood function is called an **error function**. Because error function is monotonically decreasing, maximizing the likelihhood is equivalent to minimizing the error
- bootstrap: suppose orginal data set consists of N data points at random from X. We create a new dataset $X_b$ by drawing N points at random from X, with replacement, so some points in X may be replicated in $X_B$, where other points in X may be absent from $X_B$. This process is repeated L times to generate L data sets each of size N and each obtained by sampling from the original data set X 
- One advantage of the Bayesian viewpoint is that inclusion of prior knowledge arises naturally. Suppose, that a fair-looking coin is tossed three times and lands head each time. A classical maximum likelihood estimate of the probability of landing heads would give 1. By contrast, a Bayesian approach with any reasonable prior will lead to much less extreme conclusion
*** The Gaussian distribution
For a single real-valued variable x, the Gaussian distribution is defined by 
$$
\mathcal { N } \left( x | \mu , \sigma ^ { 2 } \right) = \frac { 1 } { \left( 2 \pi \sigma ^ { 2 } \right) ^ { 1 / 2 } } \exp \left\{ - \frac { 1 } { 2 \sigma ^ { 2 } } ( x - \mu ) ^ { 2 } \right\}
$$
Two key parameters are $\sigma^2$, the standard deviation and $\mu$, the mean. The reciprocal of variance is called precision, written as $\beta = 1 / \sigma ^ { 2 }$ 
*** Curve fitting 
** Model Selection
** The Curse of Dimensionality  
** Decision Theory
** Information Theory
* Probability Distributions
