ml-notes.html
<div id="outline-container-org8a03530" class="outline-3">
<h3 id="org8a03530"><span class="section-number-3">15.4</span> unconfoundedness</h3>
<div class="outline-text-3" id="text-15-4">
<p>
An assumption that confounding variables are measured in the dataset  
</p>
</div>
</div>
</div>

<div id="outline-container-org1949e27" class="outline-2">
<h2 id="org1949e27"><span class="section-number-2">16</span> Foundations</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org719bad3" class="outline-3">
<h3 id="org719bad3"><span class="section-number-3">16.1</span> Probability Theory</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-org3b5b9af" class="outline-4">
<h4 id="org3b5b9af"><span class="section-number-4">16.1.1</span> Bayesian Probability</h4>
<div class="outline-text-4" id="text-16-1-1">
<p>
An intepretation of the concept of probability. Instead of frequency or propensity of some phenomenon, probability is intepreted as reasonable expectation representing a state of knowledge or as quantification of a personal belief.     
</p>
<ul class="org-ul">
<li>Bayes&rsquo; therom to convert prior probability to posterior probability based on evidences provided by the observed data</li>
<li>The effect of observed data \(D = {t_1,..., t_n}\) is expressed through conditional probability \(p(D|w)\)</li>
</ul>
<p>
\[
p ( \mathbf { w } | \mathcal { D } ) = \frac { p ( \mathcal { D } | \mathbf { w } ) p ( \mathbf { w } ) } { p ( \mathcal { D } ) }
\]
\(p(D|w)\) is learned from observed data, is called the <b><b>likelihood function</b></b>.
Given the definition of likelihood. We state Bayes&rsquo; therom as 
\[
\text { posterior } \propto \text { likelihood } \times \text { prior }
\]
</p>
<ul class="org-ul">
<li>negative log of the likelihood function is called an <b><b>error function</b></b>. Because error function is monotonically decreasing, maximizing the likelihhood is equivalent to minimizing the error</li>
<li>bootstrap: suppose orginal data set consists of N data points at random from X. We create a new dataset \(X_b\) by drawing N points at random from X, with replacement, so some points in X may be replicated in \(X_B\), where other points in X may be absent from \(X_B\). This process is repeated L times to generate L data sets each of size N and each obtained by sampling from the original data set X</li>
<li>One advantage of the Bayesian viewpoint is that inclusion of prior knowledge arises naturally. Suppose, that a fair-looking coin is tossed three times and lands head each time. A classical maximum likelihood estimate of the probability of landing heads would give 1. By contrast, a Bayesian approach with any reasonable prior will lead to much less extreme conclusion</li>
</ul>
</div>
</div>
<div id="outline-container-orgd31a870" class="outline-4">
<h4 id="orgd31a870"><span class="section-number-4">16.1.2</span> The Gaussian distribution</h4>
<div class="outline-text-4" id="text-16-1-2">
<p>
For a single real-valued variable x, the Gaussian distribution is defined by 
\[
\mathcal { N } \left( x | \mu , \sigma ^ { 2 } \right) = \frac { 1 } { \left( 2 \pi \sigma ^ { 2 } \right) ^ { 1 / 2 } } \exp \left\{ - \frac { 1 } { 2 \sigma ^ { 2 } } ( x - \mu ) ^ { 2 } \right\}
\]
Two key parameters are \(\sigma^2\), the standard deviation and \(\mu\), the mean. The reciprocal of variance is called precision, written as \(\beta = 1 / \sigma ^ { 2 }\) 
</p>
</div>
</div>
<div id="outline-container-org6035efc" class="outline-4">
<h4 id="org6035efc"><span class="section-number-4">16.1.3</span> Curve fitting</h4>
</div>
</div>
<div id="outline-container-org41a8235" class="outline-3">
<h3 id="org41a8235"><span class="section-number-3">16.2</span> Model Selection</h3>
</div>
<div id="outline-container-org18a35ea" class="outline-3">
<h3 id="org18a35ea"><span class="section-number-3">16.3</span> The Curse of Dimensionality</h3>
</div>
<div id="outline-container-org32299fa" class="outline-3">
<h3 id="org32299fa"><span class="section-number-3">16.4</span> Decision Theory</h3>
</div>
<div id="outline-container-orgfc91ee0" class="outline-3">
<h3 id="orgfc91ee0"><span class="section-number-3">16.5</span> Information Theory</h3>
</div>
</div>
<div id="outline-container-orgfe505cf" class="outline-2">
<h2 id="orgfe505cf"><span class="section-number-2">17</span> Probability Distributions</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ziwei</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
