ml-notes.tex
\subsection{unconfoundedness}
\label{sec:org817179f}
An assumption that confounding variables are measured in the dataset  

\section{Probability Distributions}
\label{sec:org97f4278}
\end{document}
